.source/Frontend/misc.org
#+TITLE: 其他内容


* bootstrap

http://www.bootcss.com/

专为后端人士准备的页面布局、渲染插件

* 前端三大金刚

- AngularJS
- React
- Vue

以 Vue 为主，学会简单使用，了解 MVVM 的基本概念

* 原生 JS 的使用

在 JQuery 已经过气的情况下，如何使用标准 HTML5 API

获取 DOM 节点 ID 的方式

: $("#id")

: document.getElementById("id")

: var id = 333;
: console.log(id.value);

: document.querySelector("#id");
: document.querySelectorAll("div");
* Emmet 插件

快速生成 html 代码的方案。使用了 css 语法，特别简单。效率工具。必须掌握。

* Viewport 语法

: <meta name="viewport" content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">

