Frontend/misc.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-03-22 周五 01:18 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>其他内容</title>
<meta name="generator" content="Org mode">
<meta name="author" content="unname">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">其他内容</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2043f7e">1. bootstrap</a></li>
<li><a href="#orgb5a23f7">2. 前端三大金刚</a></li>
<li><a href="#org5c33fb8">3. 原生 JS 的使用</a></li>
<li><a href="#org398b016">4. Emmet 插件</a></li>
<li><a href="#orge0d203a">5. Viewport 语法</a></li>
</ul>
</div>
</nav>


<section id="outline-container-org2043f7e" class="outline-2">
<h2 id="org2043f7e"><span class="section-number-2">1</span> bootstrap</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://www.bootcss.com/">http://www.bootcss.com/</a>
</p>

<p>
专为后端人士准备的页面布局、渲染插件
</p>
</div>
</section>

<section id="outline-container-orgb5a23f7" class="outline-2">
<h2 id="orgb5a23f7"><span class="section-number-2">2</span> 前端三大金刚</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>AngularJS</li>
<li>React</li>
<li>Vue</li>
</ul>

<p>
以 Vue 为主，学会简单使用，了解 MVVM 的基本概念
</p>
</div>
</section>

<section id="outline-container-org5c33fb8" class="outline-2">
<h2 id="org5c33fb8"><span class="section-number-2">3</span> 原生 JS 的使用</h2>
<div class="outline-text-2" id="text-3">
<p>
在 JQuery 已经过气的情况下，如何使用标准 HTML5 API
</p>

<p>
获取 DOM 节点 ID 的方式
</p>

<pre class="example">
$("#id")
</pre>

<pre class="example">
document.getElementById("id")
</pre>

<pre class="example">
var id = 333;
console.log(id.value);
</pre>

<pre class="example">
document.querySelector("#id");
document.querySelectorAll("div");
</pre>
</div>
</section>
<section id="outline-container-org398b016" class="outline-2">
<h2 id="org398b016"><span class="section-number-2">4</span> Emmet 插件</h2>
<div class="outline-text-2" id="text-4">
<p>
快速生成 html 代码的方案。使用了 css 语法，特别简单。效率工具。必须掌握。
</p>
</div>
</section>

<section id="outline-container-orge0d203a" class="outline-2">
<h2 id="orge0d203a"><span class="section-number-2">5</span> Viewport 语法</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
&lt;meta name="viewport" content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0"&gt;
</pre>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: unname</p>
<p class="date">Created: 2019-03-22 周五 01:18</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
